levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer2.c
#define IS_TIMER2_START_CONDITION(x)                                           \
(   ((x) == TIMER2_HW_START_INVALID)        ||                                 \
    ((x) == TIMER2_HW_START_TRIGA_RISE)     ||                                 \
    ((x) == TIMER2_HW_START_TRIGA_FALL)     ||                                 \
    ((x) == TIMER2_HW_START_EVENT))

#define IS_TIMER2_STOP_CONDITION(x)                                            \
(   ((x) == TIMER2_HW_STOP_INVALID)         ||                                 \
    ((x) == TIMER2_HW_STOP_TRIGA_RISE)      ||                                 \
    ((x) == TIMER2_HW_STOP_TRIGA_FALL)      ||                                 \
    ((x) == TIMER2_HW_STOP_EVENT))

#define IS_TIMER2_CLEAR_CONDITION(x)                                           \
(   ((x) == TIMER2_HW_CLR_INVALID)          ||                                 \
    ((x) == TIMER2_HW_CLR_TRIGA_RISE)       ||                                 \
    ((x) == TIMER2_HW_CLR_TRIGA_FALL)       ||                                 \
    ((x) == TIMER2_HW_CLR_EVENT))

#define IS_TIMER2_CAPTURE_CONDITION(x)                                         \
(   ((x) == TIMER2_HW_CAP_INVALID)          ||                                 \
    ((x) == TIMER2_HW_CAP_TRIGA_RISE)       ||                                 \
    ((x) == TIMER2_HW_CAP_TRIGA_FALL)       ||                                 \
    ((x) == TIMER2_HW_CAP_EVENT))

#define IS_TIMER2_PWM_START_POLARITY(x)                                        \
(   ((x) == TIMER2_PWM_START_LOW)           ||                                 \
    ((x) == TIMER2_PWM_START_HIGH)          ||                                 \
    ((x) == TIMER2_PWM_START_KEEP))

#define IS_TIMER2_PWM_STOP_POLARITY(x)                                         \
(   ((x) == TIMER2_PWM_STOP_LOW)            ||                                 \
    ((x) == TIMER2_PWM_STOP_HIGH)           ||                                 \
    ((x) == TIMER2_PWM_STOP_KEEP))

#define IS_TIMER2_TRIGGER_EVT(x)                                               \
(   ((x) == EVT_PORT_EIRQ0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ8)                 ||                                 \
    ((x) == EVT_DMA_1_TC0)                  ||                                 \
    ((x) == EVT_DAM_1_BTC0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ1)                 ||                                 \
    ((x) == EVT_PORT_EIRQ9)                 ||                                 \
    ((x) == EVT_DMA_2_TC0)                  ||                                 \
    ((x) == EVT_DAM_2_BTC0)                 ||                                 \
    ((x) == EVT_USART_1_RI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ2)                 ||                                 \
    ((x) == EVT_TMR4_SCMUH)                 ||                                 \
    ((x) == EVT_TMR4_SCMUL)                 ||                                 \
    ((x) == EVT_TMR4_SCMVH)                 ||                                 \
    ((x) == EVT_TMR4_SCMVL)                 ||                                 \
    ((x) == EVT_TMR4_SCMWH)                 ||                                 \
    ((x) == EVT_TMR4_SCMWL)                 ||                                 \
    ((x) == EVT_USART_1_TI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ3)                 ||                                 \
    ((x) == EVT_TMR0_GCMP)                  ||                                 \
    ((x) == EVT_AOS_STRG)                   ||                                 \
    ((x) == EVT_USART_3_RI)                 ||                                 \
    ((x) == EVT_SPI_SPRI)                   ||                                 \
    ((x) == EVT_PORT_EIRQ4)                 ||                                 \
    ((x) == EVT_TMRA_OVF)                   ||                                 \
    ((x) == EVT_TMRA_UDF)                   ||                                 \
    ((x) == EVT_TMRA_CMP)                   ||                                 \
    ((x) == EVT_TMRB_3_OVF)                 ||                                 \
    ((x) == EVT_TMRB_3_UDF)                 ||                                 \
    ((x) == EVT_TMRB_4_CMP)                 ||                                 \
    ((x) == EVT_ADC_EOCA)                   ||                                 \
    ((x) == EVT_USART_3_TI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ5)                 ||                                 \
    ((x) == EVT_TMR2_GCMP)                  ||                                 \
    ((x) == EVT_TMRB_4_OVF)                 ||                                 \
    ((x) == EVT_TMRB_4_UDF)                 ||                                 \
    ((x) == EVT_TMRB_3_CMP)                 ||                                 \
    ((x) == EVT_ADC_EOCB)                   ||                                 \
    ((x) == EVT_USART_2_RI)                 ||                                 \
    ((x) == EVT_IIC_RXI)                    ||                                 \
    ((x) == EVT_PORT_EIRQ6)                 ||                                 \
    ((x) == EVT_CMP_1_IRQ)                  ||                                 \
    ((x) == EVT_EVENT_PORT)                 ||                                 \
    ((x) == EVT_TMRB_1_OVF)                 ||                                 \
    ((x) == EVT_TMRB_1_UDF)                 ||                                 \
    ((x) == EVT_TMRB_2_CMP)                 ||                                 \
    ((x) == EVT_ADC_CMP0)                   ||                                 \
    ((x) == EVT_USART_2_TI)                 ||                                 \
    ((x) == EVT_IIC_TXI)                    ||                                 \
    ((x) == EVT_PORT_EIRQ7)                 ||                                 \
    ((x) == EVT_CMP_2_IRQ)                  ||                                 \
    ((x) == EVT_FMC_OPTEND)                 ||                                 \
    ((x) == EVT_TMRB_2_OVF)                 ||                                 \
    ((x) == EVT_TMRB_2_UDF)                 ||                                 \
    ((x) == EVT_TMRB_1_CMP)                 ||                                 \
    ((x) == EVT_ADC_CMP1)                   ||                                 \
    ((x) == EVT_SPI_SPTI))

/**
 * @}
 */

/**
 * @}
 */

