levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer2.c
        enRet = Ok;
        /* Start condition and stop condition CAN NOT be the same condition,
        and CAN NOT be the edge of TRIGA. */
        if ((pstcCfg->u16HwStartCondition != TIMER2_HW_START_INVALID) && \
            (pstcCfg->u16HwStopCondition  != TIMER2_HW_STOP_INVALID))
        {
            u16StopCondition = pstcCfg->u16HwStopCondition >> TMR2_HCONR_HSTP0_POS;
            if ((u16StopCondition == pstcCfg->u16HwStartCondition)         || \
                (pstcCfg->u16HwStartCondition & TIMER2_HW_START_TRIGA_MSK) || \
                (pstcCfg->u16HwStopCondition  & TIMER2_HW_STOP_TRIGA_MSK))
            {
                enRet = ErrorInvalidParameter;
            }
        }

        if (enRet == Ok)
        {
            /* Set comparison value. */
            M0P_TMR2->CMPAR = (uint32_t)pstcCfg->u16CompareVal;

            /* Set start condition and stop condition. */
            u16Temp = pstcCfg->u16HwStartCondition | pstcCfg->u16HwStopCondition;
            M0P_TMR2->HCONR = (uint32_t)u16Temp;

            /* Set start polarity and stop polarity for PWM. */
            u16Temp = (pstcCfg->u16PwmStartPolarity | \
                       pstcCfg->u16PwmStopPolarity  | \
                       TIMER2_PWM_CM_TOGGLE         | \
                       (uint16_t)TMR2_PCONR_OUTENA);
            M0P_TMR2->PCONR = (uint32_t)u16Temp;

            /* Set the clock source and clock prescaler. */
            u16Temp = pstcCfg->u16ClkSource | pstcCfg->u16ClkPrescaler;
            M0P_TMR2->BCONR = (uint32_t)u16Temp;
        }
    }

    return enRet;
}

/**
 * @brief  Configures TIMER2 peripheral as a capture function according to the specified parameters
 *         in the structure stc_timer2_config_t.
 * @param  [in]  pstcCfg            Pointer to a stc_timer2_config_t structure value that
 *                                  contains the configuration information for TIMER2.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:  -pstcCfg == NULL.
 *                                 -The stop condition is the same as the start condition.
 */
en_result_t TIMER2_CaptureConfig(const stc_timer2_config_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16Temp;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_TIMER2_CLK_SOURCE(pstcCfg->u16ClkSource));
        DDL_ASSERT(IS_TIMER2_CLK_PRESCALER(pstcCfg->u16ClkPrescaler));
        DDL_ASSERT(IS_TIMER2_START_CONDITION(pstcCfg->u16HwStartCondition));
        DDL_ASSERT(IS_TIMER2_STOP_CONDITION(pstcCfg->u16HwStopCondition));
        DDL_ASSERT(IS_TIMER2_CLEAR_CONDITION(pstcCfg->u16HwClearCondition));
        DDL_ASSERT(IS_TIMER2_CAPTURE_CONDITION(pstcCfg->u16HwCaptureCondition));
        DDL_ASSERT(IS_TIMER2_FILTER_PRESCALER(pstcCfg->u16FilterPrescaler));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCfg->enFilterCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCfg->enMatchIntCmd));

        enRet = Ok;
        /* Start condition and stop condition CAN NOT be the same condition. */
        if ((pstcCfg->u16HwStartCondition != TIMER2_HW_START_INVALID) && \
            (pstcCfg->u16HwStopCondition  != TIMER2_HW_STOP_INVALID))
        {
            if ((pstcCfg->u16HwStopCondition >> TMR2_HCONR_HSTP0_POS) == pstcCfg->u16HwStartCondition)
            {
                enRet = ErrorInvalidParameter;
            }
        }

        if (enRet == Ok)
        {
            /* Set start condition and stop condition. */
            u16Temp = (pstcCfg->u16HwStartCondition | \
                       pstcCfg->u16HwStopCondition  | \
                       pstcCfg->u16HwClearCondition | \
                       pstcCfg->u16HwCaptureCondition);
            M0P_TMR2->HCONR = (uint32_t)u16Temp;

            /* Set the prescaler of TRIGA filter. */
            M0P_TMR2->PCONR = (uint32_t)pstcCfg->u16FilterPrescaler;

            /* Enable or Disable the TRIGA filter. */
            bM0P_TMR2->PCONR_b.NOFIENA = (uint32_t)pstcCfg->enFilterCmd;

            /* Enable or Disable the counter match interrupt. */
            bM0P_TMR2->ICONR_b.CMENA   = (uint32_t)pstcCfg->enMatchIntCmd;

            /* Enable or Disable the counter match interrupt. */
            bM0P_TMR2->ICONR_b.OVENA   = (uint32_t)pstcCfg->enOvfIntCmd;

            /* Set the clock source and clock prescaler. */
            u16Temp = (pstcCfg->u16ClkSource    | \
                       pstcCfg->u16ClkPrescaler | \
                       TIMER2_FUNC_CAPTURE);
            M0P_TMR2->BCONR = (uint32_t)u16Temp;
        }
    }

    return enRet;
}

/**
 * @brief  Set trigger event for TIMER2.
 * @param  [in]  enEvent            An en_event_src_t enumeration value.
 * @retval None
 */
void TIMER2_SetTrigEvent(en_event_src_t enEvent)
{
    DDL_ASSERT(IS_TIMER2_TRIGGER_EVT(enEvent));

    TIMER2_TRIG_EVT_REG = (uint32_t)enEvent;
}

/**
 * @brief  TIMER2 get flag.
 * @param  [in]  u16Flag            TIMER2 state flag.
 *                                  This parameter can be a value of @ref TIMER2_State_Flag
 *   @arg  TIMER2_FLAG_CNT_MATCH
 *   @arg  TIMER2_FLAG_CNT_OVF
 * @retval An en_flag_status_t enumeration.
 *   @arg  Set: The specified flag is set.
 *   @arg  Reset: The specified flag is not set.
 */
en_flag_status_t TIMER2_GetFlag(uint16_t u16Flag)
{
    en_flag_status_t enFlag = Reset;

    if ((M0P_TMR2->STFLR & (uint32_t)u16Flag) != 0u)
    {
        enFlag = Set;
    }

    return enFlag;
}

/**
 * @brief  TIMER2 clear flag.
 * @param  [in]  u16Flag            TIMER2 state flag.
 *                                  This parameter can be a value of @ref TIMER2_State_Flag
 *   @arg  TIMER2_FLAG_CNT_MATCH
 *   @arg  TIMER2_FLAG_CNT_OVF
 * @retval None
 */
void TIMER2_ClrFlag(uint16_t u16Flag)
{
    M0P_TMR2->STFLR &= ~((uint32_t)u16Flag);
}

/**
 * @}
 */

#endif /* DDL_TIMER2_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
